#include <array>

struct D3Q15
{
    static constexpr int Q = 15;
    static constexpr std::array<int, Q> ex = {0, 1, 0, 0, -1, 0, 0,
                                              1, -1, 1, 1, -1, 1, -1, -1};

    static constexpr std::array<int, Q> ey = {0, 0, 1, 0, 0, -1, 0,
                                              1, 1, -1, 1, -1, -1, 1, -1};

    static constexpr std::array<int, Q> ez = {0, 0, 0, 1, 0, 0, -1,
                                              1, 1, 1, -1, -1, -1, -1, 1};

    static constexpr std::array<double, Q> uc = {0.0, 1.0, 0.0, 0.0, -1.0, 0.0, 0.0,
                                                 1.0, -1.0, 1.0, 1.0, -1.0, 1.0, -1.0, -1.0};

    static constexpr std::array<double, Q> vc = {0.0, 0.0, 1.0, 0.0, 0.0, -1.0, 0.0,
                                                 1.0, 1.0, -1.0, 1.0, -1.0, -1.0, 1.0, -1.0};

    static constexpr std::array<double, Q> wc = {0.0, 0.0, 0.0, 1.0, 0.0, 0.0, -1.0,
                                                 1.0, 1.0, 1.0, -1.0, -1.0, -1.0, -1.0, 1.0};

    static constexpr std::array<double, Q> Ei = {
        2.0 / 9.0,                                                        // 0: 静止方向
        1.0 / 9.0, 1.0 / 9.0, 1.0 / 9.0, 1.0 / 9.0, 1.0 / 9.0, 1.0 / 9.0, // 1-6: 基本方向
        1.0 / 72.0, 1.0 / 72.0, 1.0 / 72.0, 1.0 / 72.0,                   // 7-10: 对角方向
        1.0 / 72.0, 1.0 / 72.0, 1.0 / 72.0, 1.0 / 72.0                    // 11-14: 对角方向
    };

    // 压力分布函数权重 hi
    static constexpr std::array<double, Q> Hi = {
        1.0,                                   // 0: 静止方向
        0.0, 0.0, 0.0, 0.0, 0.0, 0.0,          // 1-6: 基本方向
        0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0 // 7-14: 对角方向
    };

    // 扩散函数权重 fi
    static constexpr std::array<double, Q> Fi = {
        -7.0 / 3.0,                                                       // 0: 静止方向
        1.0 / 3.0, 1.0 / 3.0, 1.0 / 3.0, 1.0 / 3.0, 1.0 / 3.0, 1.0 / 3.0, // 1-6: 基本方向
        1.0 / 24.0, 1.0 / 24.0, 1.0 / 24.0, 1.0 / 24.0,                   // 7-10: 对角方向
        1.0 / 24.0, 1.0 / 24.0, 1.0 / 24.0, 1.0 / 24.0                    // 11-14: 对角方向
    };
};
